02-Res-Latency-hotel-1profile-better/Res-firecracker-set-v1/firecracker_t_10_c_30_frontVcpu_4_wrkVcpu_1_R_3000/wrk.txt
Running 1m test @ http://frontend:5000
  10 threads and 30 connections
  Thread calibration: mean lat.: 10.256ms, rate sampling interval: 41ms
  Thread calibration: mean lat.: 10.606ms, rate sampling interval: 41ms
  Thread calibration: mean lat.: 11.274ms, rate sampling interval: 47ms
  Thread calibration: mean lat.: 10.243ms, rate sampling interval: 41ms
  Thread calibration: mean lat.: 8.350ms, rate sampling interval: 34ms
  Thread calibration: mean lat.: 12.029ms, rate sampling interval: 45ms
  Thread calibration: mean lat.: 10.296ms, rate sampling interval: 41ms
  Thread calibration: mean lat.: 11.543ms, rate sampling interval: 46ms
  Thread calibration: mean lat.: 11.402ms, rate sampling interval: 45ms
  Thread calibration: mean lat.: 11.196ms, rate sampling interval: 47ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     9.43ms    8.63ms  41.73ms   87.68%
    Req/Sec   304.16     82.45   500.00     68.21%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    6.83ms
 75.000%   12.30ms
 90.000%   19.77ms
 99.000%   41.73ms
 99.900%   68.35ms
 99.990%  112.25ms
 99.999%  137.21ms
100.000%  150.40ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.355     0.000000            1         1.00
       2.277     0.100000        15048         1.11
       3.145     0.200000        30105         1.25
       4.139     0.300000        45162         1.43
       5.371     0.400000        60210         1.67
       6.831     0.500000        75255         2.00
       7.675     0.550000        82741         2.22
       8.607     0.600000        90284         2.50
       9.655     0.650000        97797         2.86
      10.871     0.700000       105306         3.33
      12.303     0.750000       112846         4.00
      13.143     0.775000       116593         4.44
      14.087     0.800000       120367         5.00
      15.159     0.825000       124131         5.71
      16.383     0.850000       127873         6.67
      17.887     0.875000       131637         8.00
      18.767     0.887500       133527         8.89
      19.775     0.900000       135395        10.00
      20.927     0.912500       137291        11.43
      22.271     0.925000       139146        13.33
      23.855     0.937500       141038        16.00
      24.799     0.943750       141974        17.78
      25.823     0.950000       142912        20.00
      27.103     0.956250       143850        22.86
      28.511     0.962500       144791        26.67
      30.255     0.968750       145726        32.00
      31.247     0.971875       146197        35.56
      32.383     0.975000       146669        40.00
      33.727     0.978125       147142        45.71
      35.263     0.981250       147615        53.33
      37.183     0.984375       148082        64.00
      38.175     0.985938       148313        71.11
      39.455     0.987500       148547        80.00
      40.863     0.989062       148784        91.43
      42.431     0.990625       149019       106.67
      44.319     0.992188       149251       128.00
      45.599     0.992969       149369       142.22
      47.071     0.993750       149488       160.00
      48.415     0.994531       149605       182.86
      50.239     0.995313       149721       213.33
      52.415     0.996094       149842       256.00
      53.631     0.996484       149898       284.44
      55.167     0.996875       149956       320.00
      56.959     0.997266       150016       365.71
      58.751     0.997656       150074       426.67
      61.087     0.998047       150133       512.00
      62.271     0.998242       150162       568.89
      63.423     0.998437       150191       640.00
      64.991     0.998633       150222       731.43
      66.623     0.998828       150250       853.33
      68.607     0.999023       150280      1024.00
      70.015     0.999121       150294      1137.78
      71.999     0.999219       150310      1280.00
      73.215     0.999316       150324      1462.86
      75.263     0.999414       150338      1706.67
      78.783     0.999512       150353      2048.00
      80.127     0.999561       150360      2275.56
      83.199     0.999609       150368      2560.00
      86.271     0.999658       150375      2925.71
      91.519     0.999707       150382      3413.33
      97.087     0.999756       150390      4096.00
      99.071     0.999780       150393      4551.11
     101.183     0.999805       150397      5120.00
     104.511     0.999829       150401      5851.43
     106.303     0.999854       150404      6826.67
     110.655     0.999878       150408      8192.00
     111.487     0.999890       150410      9102.22
     113.023     0.999902       150412     10240.00
     115.711     0.999915       150414     11702.86
     116.415     0.999927       150415     13653.33
     122.623     0.999939       150417     16384.00
     125.183     0.999945       150418     18204.44
     126.207     0.999951       150419     20480.00
     129.919     0.999957       150420     23405.71
     131.455     0.999963       150422     27306.67
     131.455     0.999969       150422     32768.00
     131.455     0.999973       150422     36408.89
     132.863     0.999976       150423     40960.00
     132.863     0.999979       150423     46811.43
     137.215     0.999982       150424     54613.33
     137.215     0.999985       150424     65536.00
     137.215     0.999986       150424     72817.78
     139.775     0.999988       150425     81920.00
     139.775     0.999989       150425     93622.86
     139.775     0.999991       150425    109226.67
     139.775     0.999992       150425    131072.00
     139.775     0.999993       150425    145635.56
     150.399     0.999994       150426    163840.00
     150.399     1.000000       150426          inf
#[Mean    =        9.430, StdDeviation   =        8.632]
#[Max     =      150.272, Total count    =       150426]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  180084 requests in 1.00m, 74.44MB read
Requests/sec:   3001.23
Transfer/sec:      1.24MB